{
  "backend/main.mo": "Motoko backend implementing rooms, message posting, retrieval, editing, and storage with blob support and basic validation.",
  "feature_evidence.json": "Feature evidence report mapping a chat layout requirement to the RoomPage file with associated components and metadata.",
  "frontend-file-summaries.txt": "List of autogenerated short summaries describing key frontend files, features, and behavior.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark color schemes using OKLCH tokens.",
  "frontend/index.html": "Basic HTML entry point defining the root element and loading the React application.",
  "frontend/src/App.tsx": "Main React app handling theme provider, routing between lobby and room, and layout including header and conditional footer.",
  "frontend/src/components/ThemeToggle.tsx": "Dropdown theme selector component for switching between light, dark, and system modes.",
  "frontend/src/features/chat/components/MessageComposer.tsx": "Provides a chat composer with text input, file attachment, clipboard file paste, upload progress, and message submission logic.",
  "frontend/src/features/chat/components/MessageItem.tsx": "Renders a chat message with editing, deleting, replying, media display, optimistic status, and message actions.",
  "frontend/src/features/chat/reactions/ReactionBar.tsx": "Displays emoji reactions on messages and allows users to add reactions via a popover.",
  "frontend/src/features/chat/RoomPage.tsx": "Chat room page fetching messages, validating rooms, handling loading/error states, and displaying message list with fixed layout and reply support.",
  "frontend/src/features/chat/types/chatMessage.ts": "Defines client-side chat message types including optimistic send status and retry payloads.",
  "frontend/src/features/chat/utils/displayName.ts": "Returns a safe display name for message senders based on nickname or fallback to Anonymous.",
  "frontend/src/features/chat/utils/download.ts": "Provides helpers to trigger file downloads and infer file extensions from MIME types.",
  "frontend/src/features/chat/utils/messageErrors.ts": "Maps backend or network errors to user-friendly chat error messages.",
  "frontend/src/features/chat/utils/messageOrdering.ts": "Implements stable sorting and merging of chat messages with optimistic updates.",
  "frontend/src/features/lobby/EditNicknameInline.tsx": "Inline editor allowing users to update, clear, or cancel editing their nickname.",
  "frontend/src/features/lobby/LobbyPage.tsx": "Handles nickname setup, room creation, room validation, and room joining for the lobby UI.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on the user's Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity login, stored identities, and auth-client lifecycle.",
  "frontend/src/hooks/useLocalProfile.ts": "Manages a locally stored anonymous userId and nickname with persistence in localStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for rooms, messages, and chat mutations using the backend actor with polling and optimistic updates.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and chat bubble colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors from CSS variables, container settings, animations, and plugins.",
  "project_state.json": "Stores project metadata, features, architecture notes, and known issues for the chat application."
}