{
  "backend/main.mo": "Core chat canister implementing rooms, message storage, posting, editing, fetching, and nicknames with blob media support.",
  "backend/migration.mo": "Migration module defining actor state shapes and a no-op migration returning the previous state.",
  "feature_evidence.json": "Feature evidence report mapping product features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Compiled list of short summaries for all frontend files describing their responsibilities.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH theme tokens and light/dark CSS variables.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling theme, routing between lobby and room views, and footer visibility logic.",
  "frontend/src/components/ThemeToggle.tsx": "Dropdown theme switcher using next-themes with light/dark/system options.",
  "frontend/src/features/chat/components/MessageComposer.tsx": "Message composer with text, file attachment, paste handling, upload progress, and message submission via mutation.",
  "frontend/src/features/chat/components/MessageItem.tsx": "Renders a chat message with editing, deletion, media display, reactions, and optimistic status handling.",
  "frontend/src/features/chat/reactions/ReactionBar.tsx": "Displays reaction buttons and emoji picker, sending reactions via mutation.",
  "frontend/src/features/chat/RoomPage.tsx": "Chat room UI showing messages, composing, validation states, background syncing, and reply resolution.",
  "frontend/src/features/chat/types/chatMessage.ts": "Defines ChatMessage with optimistic fields and helper types plus a guard for optimistic messages.",
  "frontend/src/features/chat/utils/displayName.ts": "Returns a safe display name using nickname or fallback to Anonymous.",
  "frontend/src/features/chat/utils/download.ts": "Helpers for triggering downloads and deriving file extensions from MIME types.",
  "frontend/src/features/chat/utils/messageErrors.ts": "Parses backend or network errors into user‑friendly messages.",
  "frontend/src/features/chat/utils/messageOrdering.ts": "Provides sorting and merging logic for chat messages with optimistic handling.",
  "frontend/src/features/lobby/EditNicknameInline.tsx": "Inline nickname editor with save, cancel, and clear actions using toast feedback.",
  "frontend/src/features/lobby/LobbyPage.tsx": "Lobby UI for nickname setup, room creation/joining, and error handling using backend mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and status tracking.",
  "frontend/src/hooks/useLocalProfile.ts": "Stores a generated userId and optional nickname in localStorage with setters for updating profile info.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for rooms, messages, and message posting, using the backend actor with caching and optimistic updates.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables for light/dark mode, including chat bubble colors.",
  "frontend/src/main.tsx": "Bootstraps the app with React, react-query, InternetIdentityProvider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors bound to CSS variables, plugins, and layout settings.",
  "project_state.json": "Describes project metadata, features, issues, and architectural notes for the anonymous chat app."
}