{
  "backend/main.mo": "Main chat canister implementing room creation, message posting/editing, message retrieval, reactions, and nickname tracking with blob storage mixin and migration support.",
  "backend/migration.mo": "Migration module that resets message lists during upgrade while preserving rooms, nicknames, and message ID counter.",
  "feature_evidence.json": "Feature evidence report documenting redeploy process verification files, components, and associated requirement.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for quick reference.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme OKLCH variables and global styling.",
  "frontend/index.html": "HTML entry point containing root div and script loader for the frontend app.",
  "frontend/REDEPLOY.md": "Runbook describing the redeploy process and backend migration that clears and fixes message storage.",
  "frontend/scripts/redeploy-verify.sh": "Verification script that checks backend/frontend canister status and runs a basic backend query after redeploy.",
  "frontend/scripts/redeploy.sh": "Automated redeploy script rebuilding, upgrading, and deploying backend and frontend canisters.",
  "frontend/src/App.tsx": "Root React component handling theme, routing between lobby and room views, and URL hash-based room navigation.",
  "frontend/src/components/ThemeToggle.tsx": "Theme selector using a dropdown to switch between light, dark, and system modes.",
  "frontend/src/features/chat/components/MessageComposer.tsx": "Message input component supporting text, file attachments, uploads, and reply handling.",
  "frontend/src/features/chat/components/MessageItem.tsx": "Renders a chat message with editing, deletion, reactions, media handling, and reply display.",
  "frontend/src/features/chat/hooks/useAttachmentObjectUrl.ts": "Hook that caches and manages object URLs for media attachments with cleanup.",
  "frontend/src/features/chat/hooks/useIdleActivity.ts": "Hook tracking user activity and detecting idle state based on a timeout.",
  "frontend/src/features/chat/reactions/ReactionBar.tsx": "Emoji reaction UI allowing users to react to messages and view counts.",
  "frontend/src/features/chat/RoomPage.tsx": "Main chat room view handling message loading, scrolling, activity tracking, and reply logic.",
  "frontend/src/features/chat/types/chatMessage.ts": "Extended message types adding optimistic update metadata and helpers.",
  "frontend/src/features/chat/utils/attachmentMemo.ts": "Cache for attachment metadata keyed by fingerprint with size limits.",
  "frontend/src/features/chat/utils/detectMimeType.ts": "Lightweight MIME detection using magic numbers from byte headers.",
  "frontend/src/features/chat/utils/displayName.ts": "Utility to determine a safe display name for message senders.",
  "frontend/src/features/chat/utils/download.ts": "Provides helpers to download files from URLs or byte arrays and derive file extensions from MIME types.",
  "frontend/src/features/chat/utils/mediaFingerprint.ts": "Generates a lightweight string fingerprint for media bytes using length and boundary bytes.",
  "frontend/src/features/chat/utils/messageEquality.ts": "Compares two ChatMessage objects for structural equality using stable fields and media fingerprints.",
  "frontend/src/features/chat/utils/messageErrors.ts": "Extracts user-friendly error messages from backend or network errors with fallbacks.",
  "frontend/src/features/chat/utils/messageOrdering.ts": "Defines stable sorting and merging logic for chat messages based on timestamps and IDs.",
  "frontend/src/features/chat/utils/messageVisibility.ts": "Checks whether messages are within the last hour and filters recent messages.",
  "frontend/src/features/chat/utils/pollingStrategy.ts": "Chooses polling intervals based on tab visibility, user activity, and scroll position.",
  "frontend/src/features/chat/utils/scrollViewport.ts": "Provides helpers to access, scroll, and inspect the chat viewport element.",
  "frontend/src/features/chat/utils/structuralShareMessages.ts": "Reuses old message objects when unchanged to reduce React re-renders.",
  "frontend/src/features/lobby/EditNicknameInline.tsx": "Inline nickname editor with validation, keyboard handling, and save/cancel/clear actions.",
  "frontend/src/features/lobby/LobbyPage.tsx": "Lobby UI for setting nickname, creating rooms, and joining rooms with backend validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useLocalProfile.ts": "Manages a locally stored userId and nickname using localStorage with automatic initialization and updates.",
  "frontend/src/hooks/usePageVisibility.ts": "Tracks and returns whether the document is currently visible using the visibilitychange event.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend rooms and messages, including listing, validating, creating rooms, fetching messages, and posting messages with optimistic updates.",
  "frontend/src/hooks/useRafThrottledCallback.ts": "Creates a callback throttled to one execution per animation frame using requestAnimationFrame.",
  "frontend/src/index.css": "Tailwind base styles plus extensive CSS variables for themes, chat bubbles, and utility classes for color theming.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, theme extensions, dark mode, plugins, and CSS variable–based design tokens.",
  "project_state.json": "Project state file describing versions, issues, and feature requests, including a pending backend runtime error fix."
}