{
  "backend/main.mo": "Implements chat backend with room management, message posting/editing, retrieval, reactions, media, and nickname mapping using Motoko and blob-storage mixin.",
  "feature_evidence.json": "Declares feature-evidence report listing redeploy-related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend source files and their roles in the chat app.",
  "frontend/index.css": "Defines global Tailwind/OKLCH theme variables and light/dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the SPA and loading main.tsx.",
  "frontend/REDEPLOY.md": "Documentation outlining prerequisites and steps for performing a full backend and frontend redeploy.",
  "frontend/scripts/redeploy-verify.sh": "Shell script that verifies deployment by checking canister statuses and performing sanity checks.",
  "frontend/scripts/redeploy.sh": "Automated redeploy script that rebuilds, upgrades, regenerates bindings, builds frontend, and redeploys canisters.",
  "frontend/src/App.tsx": "Top-level React app managing theme, routing between lobby and rooms, and URL hash sync.",
  "frontend/src/components/ThemeToggle.tsx": "Dropdown theme selector allowing users to switch among light, dark, and system modes.",
  "frontend/src/features/chat/components/MessageComposer.tsx": "Message input component supporting text, file uploads, paste handling, and posting messages with progress tracking.",
  "frontend/src/features/chat/components/MessageItem.tsx": "Renders a single chat message with editing, deleting, replying, reactions, and attachment handling.",
  "frontend/src/features/chat/hooks/useAttachmentObjectUrl.ts": "Hook that caches and manages object URLs for media attachments with cleanup and fingerprinting.",
  "frontend/src/features/chat/hooks/useIdleActivity.ts": "Tracks user activity to determine idle state based on a time threshold.",
  "frontend/src/features/chat/reactions/ReactionBar.tsx": "Displays emoji reactions for a message and allows adding new reactions via a popover.",
  "frontend/src/features/chat/RoomPage.tsx": "Main chat room UI handling message fetching, bounded rendering, scrolling, reply state, and room validation.",
  "frontend/src/features/chat/types/chatMessage.ts": "Defines client-augmented chat message types for optimistic updates and retry metadata.",
  "frontend/src/features/chat/utils/attachmentMemo.ts": "Memoizes attachment metadata keyed by fingerprint with a capped cache.",
  "frontend/src/features/chat/utils/detectMimeType.ts": "Lightweight MIME detection based on magic numbers in byte data.",
  "frontend/src/features/chat/utils/displayName.ts": "Provides a safe display name for message senders, falling back to Anonymous.",
  "frontend/src/features/chat/utils/download.ts": "Utilities for downloading attachments from URLs or bytes and mapping MIME types to file extensions.",
  "frontend/src/features/chat/utils/mediaFingerprint.ts": "Generates a lightweight string fingerprint for media by combining length and boundary bytes.",
  "frontend/src/features/chat/utils/messageEquality.ts": "Compares two ChatMessage objects by stable fields and media fingerprints to determine structural equality.",
  "frontend/src/features/chat/utils/messageErrors.ts": "Maps various backend and network error patterns into short user‑friendly messages.",
  "frontend/src/features/chat/utils/messageOrdering.ts": "Provides message sorting and merging utilities using timestamps, IDs, and optimistic message handling.",
  "frontend/src/features/chat/utils/messageVisibility.ts": "Determines whether messages fall within the last hour and filters recent ones based on timestamps.",
  "frontend/src/features/chat/utils/pollingStrategy.ts": "Chooses a polling interval based on visibility, activity, and scroll position.",
  "frontend/src/features/chat/utils/scrollViewport.ts": "Retrieves a scroll viewport element and provides helpers for scrolling behavior and position checks.",
  "frontend/src/features/chat/utils/structuralShareMessages.ts": "Reuses previous message objects when unchanged to reduce React re-renders through structural sharing.",
  "frontend/src/features/lobby/EditNicknameInline.tsx": "Inline UI component for editing, saving, and clearing a user's nickname with validation.",
  "frontend/src/features/lobby/LobbyPage.tsx": "Lobby UI handling nickname setup, room creation, and room joining with validation and backend interactions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and persistence via an application-wide context.",
  "frontend/src/hooks/useLocalProfile.ts": "Manages local user ID and nickname persistence using localStorage.",
  "frontend/src/hooks/usePageVisibility.ts": "Provides a hook that returns whether the document is currently visible by listening to visibilitychange events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for room listing, room validation, creation, message fetching, and posting with optimizations and optimistic updates.",
  "frontend/src/hooks/useRafThrottledCallback.ts": "Implements a hook that throttles a callback so it runs at most once per animation frame.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables, including light/dark mode and chat bubble colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins using CSS variables.",
  "project_state.json": "Stores project metadata, feature tracking, and current state for the build system."
}