{
  "backend/main.mo": "Motoko chat backend managing rooms, messages, reactions, media blobs, and nickname lookups with create, validate, post, fetch, and edit operations.",
  "feature_evidence.json": "Feature evidence report listing files and components involved in enabling Reply on all messages, including the message UI file.",
  "frontend-file-summaries.txt": "Generated summaries describing roles of all frontend files such as hooks, components, pages, and utilities.",
  "frontend/index.css": "Tailwind base/theme styles defining OKLCH color tokens and dark mode variables for the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling theme, room routing via URL hash, and layout including header and conditional footer.",
  "frontend/src/components/ThemeToggle.tsx": "Dropdown button allowing users to switch between light, dark, and system themes.",
  "frontend/src/features/chat/components/MessageComposer.tsx": "UI component for composing and sending messages with optional file uploads, paste handling, and reply support.",
  "frontend/src/features/chat/components/MessageItem.tsx": "Renders an individual chat message with editing, deleting, media display, reactions, and retry logic for optimistic messages.",
  "frontend/src/features/chat/reactions/ReactionBar.tsx": "Displays reaction buttons for a message and allows users to add emoji reactions via a popover.",
  "frontend/src/features/chat/RoomPage.tsx": "Chat room view handling room validation, message fetching, reply context lookup, and rendering message list and composer.",
  "frontend/src/features/chat/types/chatMessage.ts": "Defines extended chat message types with optimistic update fields and helpers for identifying unsent messages.",
  "frontend/src/features/chat/utils/displayName.ts": "Returns a safe display name for a message sender, defaulting to 'Anonymous' when needed.",
  "frontend/src/features/chat/utils/download.ts": "Provides helpers to trigger file downloads and derive file extensions from MIME types.",
  "frontend/src/features/chat/utils/messageErrors.ts": "Maps backend and network errors to concise, user-friendly error messages.",
  "frontend/src/features/chat/utils/messageOrdering.ts": "Implements stable sorting and merging logic for backend and optimistic chat messages.",
  "frontend/src/features/lobby/EditNicknameInline.tsx": "Inline UI component for editing, saving, or clearing a user's nickname.",
  "frontend/src/features/lobby/LobbyPage.tsx": "Lobby interface enabling nickname setup, room creation, room joining, and validation before entering a chat room.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, exposing the user's identity along with login and logout controls.",
  "frontend/src/hooks/useLocalProfile.ts": "Manages a locally stored userId and nickname using localStorage and exposes setters for nickname updates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for rooms, messages, validation, and posting messages, integrating with the backend actor and supporting optimistic updates.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for themes, chat bubble colors, and dark mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors from CSS variables, container settings, and plugins.",
  "project_state.json": "Describes the project state, features, issues, and architecture notes for the anonymous chat app."
}