{
  "kind": "build_request",
  "title": "Fix backend runtime errors affecting message reload and redeploy",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the Motoko backend runtime errors that users encounter during normal app usage (especially when reloading room messages), and make backend message retrieval/posting resilient for rooms that exist but have missing/partial message state (e.g., room present in the room set but no initialized message list).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i keep getting backend errors, fix the issue and redeploy the app"
        ]
      },
      "acceptanceCriteria": [
        "Backend canister no longer traps/errors when calling message-related methods (e.g., getMessages, postMessage, editMessage, deleteMessage, reactToMessage) for any roomId present in backend state.",
        "If a room exists but its message list entry is missing/uninitialized, the backend self-heals (initializes the message list) and returns a valid response (e.g., getMessages returns an empty array, postMessage succeeds and persists the message).",
        "The fix does not break existing room validation behavior (validateRoom continues to return false for empty room IDs and for non-existent rooms)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Redeploy the application after the backend fix and verify the deployment using the existing redeploy scripts and checks, ensuring the backend and frontend canisters are running and a basic backend query succeeds.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "fix the issue and redeploy the app"
        ]
      },
      "acceptanceCriteria": [
        "Run the existing automated redeploy flow (frontend/scripts/redeploy.sh) successfully without errors.",
        "Run the existing post-deploy verification (frontend/scripts/redeploy-verify.sh) successfully; it confirms both canisters are running and the backend query test (listRooms) succeeds.",
        "After redeploy, manually verify from the UI that entering a room and using the reload flow no longer produces backend errors in normal conditions."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only add backend/migration.mo if the final implementation requires upgrading existing stable state; otherwise do not introduce a migration file.",
    "Do not edit files under frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui); compose around them if frontend adjustments are needed."
  ],
  "nonGoals": [
    "Adding new product features unrelated to fixing backend errors and redeploying.",
    "Introducing third-party services, external databases, or non-supported backend technologies.",
    "Implementing real-time messaging via websockets/push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}