{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redeploy runbook/script hardening for repeatable backend+frontend redeploy (no functional app changes)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the existing redeploy runbook/scripts reliably rebuild, upgrade, regenerate bindings, rebuild the frontend, deploy, and verify without introducing functional code changes.",
      "acceptanceCriteria": [
        "Running the redeploy process completes without errors (backend build, backend upgrade, binding generation, frontend build, frontend deploy).",
        "Post-deployment verification checks pass: backend canister status is Running, frontend canister status is Running, and the backend query call `listRooms` succeeds.",
        "No functional code changes are introduced as part of the redeploy."
      ],
      "file_operations": [
        {
          "path": "frontend/REDEPLOY.md",
          "operation": "modify",
          "description": "Complete and align the redeploy runbook so it explicitly references and matches the existing redeploy scripts (redeploy + verification), calls out prerequisites, and reiterates the constraint that this is a deployment-only operation with no functional changes."
        },
        {
          "path": "frontend/scripts/redeploy.sh",
          "operation": "modify",
          "description": "Harden the redeploy automation for repeatable runs (e.g., stricter bash flags, clearer logging, and consistent sequencing of build/upgrade/generate/build/deploy) while preserving the same redeploy intent and avoiding any application logic changes."
        },
        {
          "path": "frontend/scripts/redeploy-verify.sh",
          "operation": "modify",
          "description": "Fix verification flow robustness so the backend `listRooms` check is correctly evaluated under strict error handling (avoid brittle `$?` checks after command substitution with `set -e`), and keep output focused on the required running-status checks and the `listRooms` call."
        }
      ]
    }
  ]
}